In [1]:
import pandas as pd

# Import

In [2]:
gmlogs = pd.read_csv('data/gamelogs-coaches.csv')

In [3]:
gmlogs.head()

  franchise team  season  game_num        date result       coach
0       ATL  ATL    2001         1  2000-10-31      L  krugelo99c
1       ATL  ATL    2001         2  2000-11-02      L  krugelo99c
2       ATL  ATL    2001         3  2000-11-04      L  krugelo99c
3       ATL  ATL    2001         4  2000-11-06      L  krugelo99c
4       ATL  ATL    2001         5  2000-11-07      L  krugelo99c

In [4]:
tenures = pd.read_csv('categorized/tenures-summarized-categorized.csv')

In [5]:
tenures.head()

,slug,coach,coach_id,franchise,min_date,max_date,left_truncated,ending
0,krugelo99c|00|02|ATL,Lon Kruger,krugelo99c,ATL,2000-10-31,2002-12-23,True,fired
1,stottte99c|02|04|ATL,Terry Stotts,stottte99c,ATL,2002-12-27,2004-04-14,False,fired
2,woodsmi01c|04|10|ATL,Mike Woodson,woodsmi01c,ATL,2004-11-03,2010-04-14,False,fired
3,drewla01c|10|13|ATL,Larry Drew,drewla01c,ATL,2010-10-27,2013-04-17,False,fired
4,budenmi99c|13|17|ATL,Mike Budenholzer,budenmi99c,ATL,2013-10-30,2017-12-14,False,NaN

In [6]:
tenures.tail()

,slug,coach,coach_id,franchise,min_date,max_date,left_truncated,ending
213,jordaed01c|03|08|WAS,Eddie Jordan,jordaed01c,WAS,2003-10-29,2008-11-22,False,fired
214,tapsced99c|08|09|WAS,Ed Tapscott,tapsced99c,WAS,2008-11-25,2009-04-15,False,fired
215,saundfl99c|09|12|WAS,Flip Saunders,saundfl99c,WAS,2009-10-27,2012-01-23,False,fired
216,wittmra01c|12|16|WAS,Randy Wittman,wittmra01c,WAS,2012-01-25,2016-04-13,False,fired
217,brooksc01c|16|17|WAS,Scott Brooks,brooksc01c,WAS,2016-10-27,2017-12-13,False,NaN

In [7]:
elo = pd.read_csv('elo/elo_teams.csv')

In [8]:
elo.head()

         date  season playoff team        elo    win franchise
0  1979-10-12    1980     NaN  NYK  1412.8352  False       NYK
1  1979-10-12    1980     NaN  HOU  1522.1215  False       HOU
2  1979-10-12    1980     NaN  IND  1490.5132  False       IND
3  1979-10-12    1980     NaN  MIL  1547.1157  False       MIL
4  1979-10-12    1980     NaN  CLE  1412.1134  False       CLE

# Calcs

##  Time-dependent data

By game

In [9]:
bygame = pd.merge(
    gmlogs.rename(columns={'coach': 'coach_id',}),
    tenures[['slug','coach_id','min_date']].rename(columns={'min_date': 'date',}),
    how='left'
)\
.fillna(method='ffill')\
.merge(elo[['franchise','date','elo']], how='left')\
.merge(tenures[['slug','ending','max_date']].rename(columns={'max_date': 'date'}), how='left')

In [10]:
bygame[180:200]

,franchise,team,season,game_num,date,result,coach_id,slug,elo,ending
180,ATL,ATL,2003,17,2002-11-30,L,krugelo99c,krugelo99c|00|02|ATL,1463.1555,NaN
181,ATL,ATL,2003,18,2002-12-03,L,krugelo99c,krugelo99c|00|02|ATL,1458.1422,NaN
182,ATL,ATL,2003,19,2002-12-05,W,krugelo99c,krugelo99c|00|02|ATL,1469.4189,NaN
183,ATL,ATL,2003,20,2002-12-07,W,krugelo99c,krugelo99c|00|02|ATL,1473.8914,NaN
184,ATL,ATL,2003,21,2002-12-11,L,krugelo99c,krugelo99c|00|02|ATL,1468.6079,NaN
185,ATL,ATL,2003,22,2002-12-12,L,krugelo99c,krugelo99c|00|02|ATL,1461.1869,NaN
186,ATL,ATL,2003,23,2002-12-14,L,krugelo99c,krugelo99c|00|02|ATL,1445.1106,NaN
187,ATL,ATL,2003,24,2002-12-17,L,krugelo99c,krugelo99c|00|02|ATL,1431.8984,NaN
188,ATL,ATL,2003,25,2002-12-20,L,krugelo99c,krugelo99c|00|02|ATL,1424.5349,NaN
189,ATL,ATL,2003,26,2002-12-21,W,krugelo99c,krugelo99c|00|02|ATL,1429.6897,NaN
190,ATL,ATL,2003,27,2002-12-23,L,krugelo99c,krugelo99c|00|02|ATL,1424.8250,fired
191,ATL,ATL,2003,28,2002-12-27,W,stottte99c,stottte99c|02|04|ATL,1431.2126,NaN
192,ATL,ATL,2003,29,2002-12-28,L,stottte99c,stottte99c|02|04|ATL,1426.3698,NaN
193,ATL,ATL,2003,30,2002-12-30,L,stottte99c,stottte99c|02|04|ATL,1420.7389,NaN
194,ATL,ATL,2003,31,2003-01-01,L,stottte99c,stottte99c|02|04|ATL,1391.5050,NaN
195,ATL,ATL,2003,32,2003-01-04,L,stottte99c,stottte99c|02|04|ATL,1386.8776,NaN
196,ATL,ATL,2003,33,2003-01-06,L,stottte99c,stottte99c|02|04|ATL,1382.8998,NaN
197,ATL,ATL,2003,34,2003-01-08,L,stottte99c,stottte99c|02|04|ATL,1377.2006,NaN
198,ATL,ATL,2003,35,2003-01-10,W,stottte99c,stottte99c|02|04|ATL,1388.1639,NaN
199,ATL,ATL,2003,36,2003-01-11,W,stottte99c,stottte99c|02|04|ATL,1397.8116,NaN

In [11]:
bygame['cum_games'] = bygame.groupby('slug').date.rank()

In [12]:
bygame['win'] = (bygame.result == 'W')
bygame['cum_wins'] = bygame.groupby('slug').win.cumsum()
bygame.drop('win',axis=1,inplace=True)

In [13]:
bygame['cum_losses'] = bygame.cum_games - bygame.cum_wins
bygame['cum_win_pct'] = bygame.cum_wins / bygame.cum_games

In [14]:
bygame.head()

,franchise,team,season,game_num,date,result,coach_id,slug,elo,ending,cum_games,cum_wins,cum_losses,cum_win_pct
0,ATL,ATL,2001,1,2000-10-31,L,krugelo99c,krugelo99c|00|02|ATL,1354.0496,NaN,1.0,0.0,1.0,0.0
1,ATL,ATL,2001,2,2000-11-02,L,krugelo99c,krugelo99c|00|02|ATL,1348.6038,NaN,2.0,0.0,2.0,0.0
2,ATL,ATL,2001,3,2000-11-04,L,krugelo99c,krugelo99c|00|02|ATL,1344.0852,NaN,3.0,0.0,3.0,0.0
3,ATL,ATL,2001,4,2000-11-06,L,krugelo99c,krugelo99c|00|02|ATL,1338.3126,NaN,4.0,0.0,4.0,0.0
4,ATL,ATL,2001,5,2000-11-07,L,krugelo99c,krugelo99c|00|02|ATL,1336.7889,NaN,5.0,0.0,5.0,0.0

##  Overall calcs

In [15]:
winloss = bygame.groupby('slug')\
[['cum_games','cum_wins']]\
.max()\
.rename(columns={'cum_games':'total_games','cum_wins':'total_wins'})\
.reset_index()

In [16]:
winloss['total_losses'] = winloss.total_games - winloss.total_wins
# winloss['win_pct'] = winloss.total_wins / winloss.total_games

In [17]:
winloss.head()

                      slug  total_games  total_wins  total_losses
0     adelmri01c|00|06|SAC        492.0       324.0         168.0
1     adelmri01c|07|11|HOU        328.0       193.0         135.0
2     adelmri01c|11|14|MIN        230.0        97.0         133.0
3  atkinke01c|16|17|NJNBRK        109.0        31.0          78.0
4     ayersra99c|03|04|PHI         52.0        21.0          31.0

In [18]:
def get_end_rating(df):
    return df.elo.iloc[len(df)-1]

def get_start_rating(df):
    return df.elo.iloc[0]

def get_improvement(df):
    return df.elo.iloc[len(df)-1] - df.elo.iloc[0]

def get_last_improvement(df):
    maxyear = df[df.season == df.season.max()]
    return maxyear.elo.iloc[len(maxyear)-1] - maxyear.elo.iloc[0]

In [19]:
grps = bygame.groupby('slug')

In [20]:
startrating = grps.apply(get_start_rating).sort_values().rename('start_rating').reset_index()

In [21]:
endrating = grps.apply(get_end_rating).sort_values().rename('end_rating').reset_index()

In [22]:
improvement = grps.apply(get_improvement).sort_values().rename('improvement').reset_index()

In [23]:
middle = grps.elo.median().sort_values().rename('middle').reset_index()
top = grps.elo.max().sort_values().rename('top').reset_index()
bottom = grps.elo.min().sort_values().rename('bottom').reset_index()

In [24]:
lastimprovement = grps.apply(get_last_improvement).sort_values().rename('last_improvement').reset_index()

In [25]:
effects = startrating\
.merge(endrating)\
.merge(improvement)\
.merge(top)\
.merge(bottom)\
.merge(middle)\
.merge(lastimprovement)

In [26]:
bytenure = tenures[['slug','coach','coach_id','ending']]\
.merge(winloss)\
.merge(effects)

In [27]:
bytenure.sample(5)

,slug,coach,coach_id,ending,total_games,total_wins,total_losses,start_rating,end_rating,improvement,top,bottom,middle,last_improvement
157,collido01c|10|13|PHI,Doug Collins,collido01c,resigned,230.0,110.0,120.0,1404.4315,1444.587300,40.155800,1594.1030,1367.360100,1498.317450,-100.583000
4,budenmi99c|13|17|ATL,Mike Budenholzer,budenmi99c,NaN,356.0,195.0,161.0,1479.5092,1372.671326,-106.837874,1701.1826,1372.671326,1520.065407,-122.969061
31,brownmi99c|05|10|CLE,Mike Brown,brownmi99c,fired,410.0,272.0,138.0,1480.5029,1701.493700,220.990800,1762.7637,1470.319700,1565.921600,31.928000
65,tomjaru01c|00|03|HOU,Rudy Tomjanovich,tomjaru01c,resigned,246.0,116.0,130.0,1482.2604,1540.624900,58.364500,1604.0952,1373.045400,1508.262200,138.515400
88,dantomi01c|12|14|LAL,Mike D'Antoni,dantomi01c,mutual,154.0,67.0,87.0,1545.8198,1394.331400,-151.488400,1569.0409,1338.611500,1499.825450,-127.862800

In [28]:
effects.sample(5)

,slug,start_rating,end_rating,improvement,top,bottom,middle,last_improvement
110,delnevi01c|08|10|CHI,1454.838100,1497.713300,42.875200,1544.440600,1394.520100,1468.444150,-29.879000
40,snydequ01c|14|17|UTA,1367.042200,1547.604855,180.562655,1625.402040,1347.619800,1538.257580,-37.860060
25,trianja99c|17|17|PHO,1348.916343,1346.794914,-2.121429,1393.157078,1337.226458,1355.876316,-2.121429
44,thomais01c|06|08|NYK,1375.634000,1310.926500,-64.707500,1457.130900,1281.659500,1391.363500,-107.133300
74,silaspa01c|10|12|CHARBH,1417.805900,1151.716300,-266.089600,1478.665800,1151.716300,1395.046550,-274.322400

In [29]:
bytenure.to_csv('analysis/bytenure.csv', index=False)